In [3]:
import pandas as pd
from pathlib import Path

In [7]:
df_c = pd.read_csv(r'clients.csv', encoding="UTF8")
df_v = pd.read_csv(r'ventes.csv', encoding="UTF8")
df_p = pd.read_csv(r'produits.csv', encoding="UTF8")

In [26]:
df_c

     client_id sex  birth
0       c_4410   f   1967
1       c_7839   f   1975
2       c_1699   f   1984
3       c_5961   f   1962
4       c_5320   m   1943
...        ...  ..    ...
8618    c_7920   m   1956
8619    c_7403   f   1970
8620    c_5119   m   1974
8621    c_5643   f   1968
8622      c_84   f   1982

[8623 rows x 3 columns]

In [21]:
df_c.describe(include ='all').round(1)

       client_id   sex   birth
count       8623  8623  8623.0
unique      8623     2     NaN
top       c_3029     f     NaN
freq           1  4491     NaN
mean         NaN   NaN  1978.3
std          NaN   NaN    16.9
min          NaN   NaN  1929.0
25%          NaN   NaN  1966.0
50%          NaN   NaN  1979.0
75%          NaN   NaN  1992.0
max          NaN   NaN  2004.0

In [27]:
df_c.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8623 entries, 0 to 8622
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8623 non-null   object
 1   sex        8623 non-null   object
 2   birth      8623 non-null   int64
dtypes: int64(1), object(2)
memory usage: 202.2+ KB

In [22]:
df_c.isna().any().sum()

0

In [25]:
df_c.client_id.duplicated().sum()

0

In [44]:
df_c[~df_c.client_id.str.contains("c_")]

     client_id sex  birth
2735      ct_0   f   2001
8494      ct_1   m   2001

In [45]:
clients = df_c.copy()

In [48]:
for i in clients['birth']:
    clients['age'] = 2021-i

In [50]:
clients['age'] = 2021-clients['birth']

In [51]:
clients

     client_id sex  birth  age
0       c_4410   f   1967   54
1       c_7839   f   1975   46
2       c_1699   f   1984   37
3       c_5961   f   1962   59
4       c_5320   m   1943   78
...        ...  ..    ...  ...
8618    c_7920   m   1956   65
8619    c_7403   f   1970   51
8620    c_5119   m   1974   47
8621    c_5643   f   1968   53
8622      c_84   f   1982   39

[8623 rows x 4 columns]